In [3]:
import pandas as pd

In [4]:
df = pd.read_excel("zingat321.xlsx")
df.drop("Unnamed: 0", axis = 1, inplace = True)
df.head()

,yas,Bina_kat_sayisi,net_alan,oda_sayisi,kat,isinma,ilce,fiyat
0,0-,0-5,170+,5+1,0.Kat,Kombi Doğalgaz,Beylikdüzü,12000000
1,0-,0-5,102-128,2+1,0.Kat,Kombi Doğalgaz,Beylikdüzü,579000
2,0-,0-5,128-170,3+1,Çatı Dubleks,Kombi Doğalgaz,Beylikdüzü,1179000
3,5-10,5_20,102-128,3+1,3. Kat,Kombi Doğalgaz,Beylikdüzü,2500000
4,4,0-5,85-102,2+1,0.Kat,Kombi Doğalgaz,Beylikdüzü,820000

In [5]:
df

,yas,Bina_kat_sayisi,net_alan,oda_sayisi,kat,isinma,ilce,fiyat
0,0-,0-5,170+,5+1,0.Kat,Kombi Doğalgaz,Beylikdüzü,12000000
1,0-,0-5,102-128,2+1,0.Kat,Kombi Doğalgaz,Beylikdüzü,579000
2,0-,0-5,128-170,3+1,Çatı Dubleks,Kombi Doğalgaz,Beylikdüzü,1179000
3,5-10,5_20,102-128,3+1,3. Kat,Kombi Doğalgaz,Beylikdüzü,2500000
4,4,0-5,85-102,2+1,0.Kat,Kombi Doğalgaz,Beylikdüzü,820000
...,...,...,...,...,...,...,...,...
844,21-40,0-5,0-85,2+1,-1.Kat,Kombi Doğalgaz,Ümraniye,1050000
845,11-15,0-5,85-102,2+1,-1.Kat,Kombi Doğalgaz,Şile,1210000
846,4,0-5,102-128,3+1,2. Kat,Kombi Doğalgaz,Şile,5600000
847,11-15,0-5,0-85,2+1,0.Kat,Kombi Doğalgaz,Maltepe,1249000
848,4,0-5,85-102,2+1,1. Kat,Kombi Doğalgaz,Beylikdüzü,2200000

In [6]:
df_5=df

In [7]:
df_5.head()

,yas,Bina_kat_sayisi,net_alan,oda_sayisi,kat,isinma,ilce,fiyat
0,0-,0-5,170+,5+1,0.Kat,Kombi Doğalgaz,Beylikdüzü,12000000
1,0-,0-5,102-128,2+1,0.Kat,Kombi Doğalgaz,Beylikdüzü,579000
2,0-,0-5,128-170,3+1,Çatı Dubleks,Kombi Doğalgaz,Beylikdüzü,1179000
3,5-10,5_20,102-128,3+1,3. Kat,Kombi Doğalgaz,Beylikdüzü,2500000
4,4,0-5,85-102,2+1,0.Kat,Kombi Doğalgaz,Beylikdüzü,820000

In [8]:
df_5.columns

Index(['yas', 'Bina_kat_sayisi', 'net_alan', 'oda_sayisi', 'kat', 'isinma',
       'ilce', 'fiyat'],
      dtype='object')

In [9]:
import pandas as pd

In [10]:
df = pd.read_excel("zingat321.xlsx")
df.drop("Unnamed: 0", axis = 1, inplace = True)
df_5 = df.copy()
df_6 = df.copy()

In [12]:
df_5.kat.value_counts()

0.Kat           218
1. Kat          189
2. Kat          135
4. Kat          103
5+Kat           102
-1.Kat           47
3. Kat           35
Çatı Dubleks      8
Villa Tipi        7
Çatı Katı         2
8. Kat            2
-2.Kat            1
Name: kat, dtype: int64

In [13]:
df_5.columns

Index(['yas', 'Bina_kat_sayisi', 'net_alan', 'oda_sayisi', 'kat', 'isinma',
       'ilce', 'fiyat'],
      dtype='object')

In [14]:
from sklearn import preprocessing 
le = preprocessing.LabelEncoder()

In [15]:
df_6["ilce"] = le.fit_transform(df_5.ilce)

In [ ]:
# le.classes_

In [40]:
df_6.isinma.unique()

array(['Kombi Doğalgaz', 'Merkezi (Pay Ölçer)', 'Merkezi Doğalgaz',
       'Doğalgaz Sobalı', 'Isıtma Yok', 'Yerden Isıtma'], dtype=object)

In [41]:
le.inverse_transform([0])

array(['Arnavutköy '], dtype=object)

In [42]:
df_6["isinma"]  = le.fit_transform(df_5.isinma)

In [43]:
le.classes_

array(['Doğalgaz Sobalı', 'Isıtma Yok', 'Kombi Doğalgaz',
       'Merkezi (Pay Ölçer)', 'Merkezi Doğalgaz', 'Yerden Isıtma'],
      dtype=object)

In [45]:
le.inverse_transform([1])

array(['Isıtma Yok'], dtype=object)

In [179]:
df_6["oda_sayisi"] = le.fit_transform(df_5.oda_sayisi)

In [180]:
#yas sutununu string değere çevirdim.
convert_dict = {'yas': str}

In [47]:
df_6["yas"] = le.fit_transform(df_5.yas)

In [184]:
df_6

,yas,Bina_kat_sayisi,net_alan,oda_sayisi,kat,isinma,ilce,fiyat
0,0,0,3,8,0.Kat,2,8,12000000
1,0,0,1,1,0.Kat,2,8,579000
2,0,0,2,3,Çatı Dubleks,2,8,1179000
3,8,2,1,3,3. Kat,2,8,2500000
4,7,0,4,1,0.Kat,2,8,820000
...,...,...,...,...,...,...,...,...
844,5,0,0,1,-1.Kat,2,32,1050000
845,2,0,4,1,-1.Kat,2,34,1210000
846,7,0,1,3,2. Kat,2,34,5600000
847,2,0,0,1,0.Kat,2,22,1249000
848,7,0,4,1,1. Kat,2,8,2200000

In [55]:
df_6["Bina_kat_sayisi"]= le.fit_transform(df_5.Bina_kat_sayisi)

In [56]:
le.classes_

array(['0-5', '20+', '5_20'], dtype=object)

In [185]:
#excel dosyasına kaydettim.
df_6.to_excel("ilce_31.xlsx")

In [186]:
import pandas as pd

In [194]:
df = pd.read_excel("ilce_31.xlsx")
df.drop("Unnamed: 0", axis = 1, inplace = True)
df.head()

,yas,Bina_kat_sayisi,net_alan,oda_sayisi,kat,isinma,ilce,fiyat
0,0,0,3,8,0.Kat,2,8,12000000
1,0,0,1,1,0.Kat,2,8,579000
2,0,0,2,3,Çatı Dubleks,2,8,1179000
3,8,2,1,3,3. Kat,2,8,2500000
4,7,0,4,1,0.Kat,2,8,820000

In [195]:
df.kat.value_counts()

0.Kat           218
1. Kat          189
2. Kat          135
4. Kat          103
5+Kat           102
-1.Kat           47
3. Kat           35
Çatı Dubleks      8
Villa Tipi        7
Çatı Katı         2
8. Kat            2
-2.Kat            1
Name: kat, dtype: int64

In [196]:
df['kat'] = df['kat'].astype(str)

In [197]:
df["kat"] = le.fit_transform(df.kat)

In [198]:
le.classes_

array(['-1.Kat', '-2.Kat', '0.Kat', '1. Kat', '2. Kat', '3. Kat',
       '4. Kat', '5+Kat', '8. Kat', 'Villa Tipi', 'Çatı Dubleks',
       'Çatı Katı'], dtype=object)

In [199]:
df.to_excel("son_hali_zin12.xlsx")

In [201]:
df.to_excel("son_hali_z1.xlsx")